camel-spring-boot/src/main/java/cn/gkq/camel/cxf/queryWeather.wsdl

<!--  Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e.  -->
<!--  Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e.  -->
<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://impl.webservice.gkq.cn/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://impl.webservice.gkq.cn/" name="WeatherServiceImplService">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://impl.webservice.gkq.cn/" schemaLocation="weather.xsd"/>
        </xsd:schema>
    </types>
    <message name="queryWater">
        <part name="parameters" element="tns:queryWater"/>
    </message>
    <message name="queryWaterResponse">
        <part name="parameters" element="tns:queryWaterResponse"/>
    </message>
    <message name="queryWeather">
        <part name="parameters" element="tns:queryWeather"/>
    </message>
    <message name="queryWeatherResponse">
        <part name="parameters" element="tns:queryWeatherResponse"/>
    </message>
    <portType name="WeatherServiceImpl">
        <operation name="queryWater">
            <input wsam:Action="http://impl.webservice.gkq.cn/WeatherServiceImpl/queryWaterRequest" message="tns:queryWater"/>
            <output wsam:Action="http://impl.webservice.gkq.cn/WeatherServiceImpl/queryWaterResponse" message="tns:queryWaterResponse"/>
        </operation>
        <operation name="queryWeather">
            <input wsam:Action="http://impl.webservice.gkq.cn/WeatherServiceImpl/queryWeatherRequest" message="tns:queryWeather"/>
            <output wsam:Action="http://impl.webservice.gkq.cn/WeatherServiceImpl/queryWeatherResponse" message="tns:queryWeatherResponse"/>
        </operation>
    </portType>
    <binding name="WeatherServiceImplPortBinding" type="tns:WeatherServiceImpl">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="queryWater">
            <soap:operation soapAction=""/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
        <operation name="queryWeather">
            <soap:operation soapAction=""/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="WeatherServiceImplService">
        <port name="WeatherServiceImplPort" binding="tns:WeatherServiceImplPortBinding">
            <soap:address location="http://localhost:8099/weather"/>
        </port>
    </service>
</definitions>